import React, { useState } from 'react';
import s from './Pattern.module.scss';
import trashIcon from '../../assets/img/icons/trash.svg';
import settingsIcon from '../../assets/img/icons/settings.svg';
import editIcon from '../../assets/img/icons/edit.svg';
import RadioButton from '../UI/RadioButton/RadioButton';

type PatternProps = {
  id: number;
  name: string;
  hasRadio: boolean;
  index: number;
};

const Pattern: React.FC<PatternProps> = ({ id, name, hasRadio, index }) => {
  // Переделать верстку под каждый шаблон индивидуально
  // Нарисовать свгшки
  const [selectedIndex, setSelectedIndex] = useState(0);

  return (
    <div className={s['pattern']}>
      <div className={s['wrapper']}>
        <div className={s['pattern-items']}>
          <div className={s['item1']}></div>
          <div className={s['item2']}></div>
          <div className={s['item3']}></div>
        </div>
        <button className={`${s['action-btn']} ${s['delete-btn']}`}>
          <svg
            width="24"
            height="28"
            viewBox="0 0 24 28"
            fill="none"
            xmlns="http://www.w3.org/2000/svg">
            <path
              className={s['trash']}
              d="M2 6.70374L22.3704 6.70373"
              stroke="white"
              strokeWidth="3"
              strokeLinecap="round"
            />
            <path
              className={s['trash']}
              d="M7 6V6C7 3.79086 8.79086 2 11 2H13C15.2091 2 17 3.79086 17 6V6"
              stroke="white"
              strokeWidth="3"
              strokeLinecap="round"
            />
            <path
              className={s['trash']}
              d="M3.7618 27.0995L2.10995 10.5809C2.05108 9.99226 2.51337 9.48145 3.10499 9.48145H12.1852H21.2654C21.857 9.48145 22.3193 9.99226 22.2604 10.5809L20.6086 27.0995C20.5574 27.6107 20.1273 28 19.6135 28H4.75684C4.24309 28 3.81292 27.6107 3.7618 27.0995Z"
              fill="white"
            />
            <path
              d="M7.55556 12.2593L8.48148 25.2222"
              stroke="black"
              strokeWidth="2"
              strokeLinecap="round"
            />
            <path
              d="M12.1852 25.2222L12.1852 12.2593"
              stroke="black"
              strokeWidth="2"
              strokeLinecap="round"
            />
            <path
              d="M16.8148 12.2593L15.8889 25.2222"
              stroke="black"
              strokeWidth="2"
              strokeLinecap="round"
            />
          </svg>
        </button>
        <button className={`${s['action-btn']} ${s['forward-btn']}`}>
          <svg
            width="38"
            height="30"
            viewBox="0 0 38 30"
            fill="none"
            xmlns="http://www.w3.org/2000/svg">
            <path
              d="M17.9986 8C19.5398 7.67914 21.9986 7.5 21.9986 7.5V1C21.9986 0.400341 22.4986 0 22.9986 0C23.4986 0 23.9986 0.5 23.9986 0.5L30.4986 7L36.9986 13L37.5 13.5L36.9986 14L35.4986 15.5L23.4986 27H22.4986L21.9986 26V19.5H18.9986C18.9986 19.5 16.8398 19.6717 15.4986 20C13.8782 20.3967 13.0167 20.8081 11.4986 21.5C10.704 21.8621 10.2429 22.0433 9.49864 22.5C9.12567 22.7289 7.92084 23.6557 6.99864 24.5C6.38761 25.0594 6.04506 25.3773 5.49864 26C4.85468 26.7338 3.99864 28 3.99864 28C3.60812 28.5858 3.29605 29.0556 2.99978 29.5C2.7035 29.9444 2.99864 30 1.99864 30C1.7225 30 1.49978 30 0.998641 29.5C0.860414 29.3621 0.999777 28 0.999777 28C0.999777 28 0.99933 27.5 0.999777 26.5C1 26 1.49864 24 1.49864 24C1.49864 24 2.02844 22.1419 2.49864 21C2.99737 19.7888 3.34374 19.1344 3.99864 18C4.70264 16.7806 5.09299 16.0782 5.99864 15C6.70909 14.1542 7.16103 13.7201 7.99864 13C8.73899 12.3636 9.19911 12.0603 9.99864 11.5C10.5752 11.096 10.8964 10.8647 11.4986 10.5C12.619 9.82145 13.2797 9.47949 14.4986 9C15.8215 8.47964 16.607 8.28974 17.9986 8Z"
              fill="#9b9b9b"
            />
          </svg>
        </button>
        <button className={`${s['action-btn']} ${s['settings-btn']}`}>
          <svg
            width="26"
            height="26"
            viewBox="0 0 26 26"
            fill="none"
            xmlns="http://www.w3.org/2000/svg">
            <path
              d="M22.0427 12.5432C22.0427 17.7899 17.7894 22.0432 12.5427 22.0432C7.29599 22.0432 3.04269 17.7899 3.04269 12.5432C3.04269 7.29651 7.29599 3.04321 12.5427 3.04321C17.7894 3.04321 22.0427 7.29651 22.0427 12.5432ZM7.54269 12.5432C7.54269 15.5794 9.50649 17.5432 12.5427 17.5432C15.5789 17.5432 17.5427 15.5794 17.5427 12.5432C17.5427 9.50701 15.5789 7.54321 12.5427 7.54321C9.50649 7.54321 7.54269 9.50701 7.54269 12.5432Z"
              fill="white"
            />
            <path
              d="M10.0427 0.0429267C9.54268 0.542601 9.54268 3.54236 9.54268 3.54236H15.5427C15.5427 3.54236 15.5427 0.542359 15.0427 0.0423476C14.9993 -0.00107004 10.1117 -0.02606 10.0427 0.0429267Z"
              fill="white"
            />
            <path
              d="M2.05285 5.3593C2.05262 6.06617 4.17377 8.18732 4.17377 8.18732L8.41641 3.94468C8.41641 3.94468 6.29509 1.82336 5.58798 1.82335C5.52658 1.82335 2.05288 5.2617 2.05285 5.3593Z"
              fill="white"
            />
            <path
              d="M23.4062 5.3593C23.4065 6.06617 20.9726 8.5 20.9726 8.5L16.5 4.48736C16.5 4.48736 19.164 1.82336 19.8711 1.82335C19.9325 1.82335 23.4062 5.2617 23.4062 5.3593Z"
              fill="white"
            />
            <path
              d="M23.0427 19.5424C23.0429 18.8355 21.0427 16.5423 21.0427 16.5423L16.5427 21.0424C16.5427 21.0424 18.8356 23.0423 19.5427 23.0423C19.6041 23.0423 23.0426 19.64 23.0427 19.5424Z"
              fill="white"
            />
            <path
              d="M2.04268 19.5423C2.04246 18.8354 4.5 16.585 4.5 16.585L8.54231 20.5427C8.54231 20.5427 6.2498 23.0423 5.54268 23.0423C5.48128 23.0423 2.04272 19.6399 2.04268 19.5423Z"
              fill="white"
            />
            <path
              d="M10.0427 25.0423C9.5427 24.6192 9.54269 21.5424 9.54269 21.5424H15.5427C15.5427 21.5424 15.5427 24.6189 15.0427 25.0424C14.9993 25.0791 10.1117 25.1008 10.0427 25.0423Z"
              fill="white"
            />
            <path
              d="M0.0426856 15.0424C0.54236 15.5424 3.54269 15.5424 3.54269 15.5424L3.54269 9.54236C3.54269 9.54236 0.54269 9.54236 0.0426788 10.0424C-0.000738814 10.0858 -0.0263012 14.9733 0.0426856 15.0424Z"
              fill="white"
            />
            <path
              d="M25.0427 15.0424C24.543 15.5424 21.5427 15.5424 21.5427 15.5424V9.54236C21.5427 9.54236 24.5427 9.54236 25.0427 10.0424C25.0861 10.0858 25.1117 14.9733 25.0427 15.0424Z"
              fill="white"
            />
          </svg>
        </button>
        {hasRadio && (
          <RadioButton
            checked={selectedIndex === index}
            onChange={() => setSelectedIndex(index)}
            name={'pattern'}
          />
        )}
      </div>
      <div className={s['info']}>
        <span className={s['name']}>{name}</span>
        <button className={s['edit-btn']}>
          <svg
            width="26"
            height="26"
            viewBox="0 0 26 26"
            fill="none"
            xmlns="http://www.w3.org/2000/svg">
            <path
              d="M11.5 5.0647H1.5C1.22386 5.0647 1 5.28855 1 5.5647V23.5647C1 23.8408 1.22386 24.0647 1.5 24.0647H19.5C19.7761 24.0647 20 23.8408 20 23.5647V13.5647"
              stroke="white"
              strokeWidth="2"
              strokeLinecap="round"
            />
            <path
              d="M13.3516 15.5944L9.23544 16.4176C8.88557 16.4876 8.57712 16.1791 8.64709 15.8293L9.47031 11.7131C9.48967 11.6163 9.53725 11.5274 9.60705 11.4576L18 3.0647L22 7.0647L13.607 15.4577C13.5372 15.5275 13.4483 15.575 13.3516 15.5944Z"
              fill="white"
            />
            <path
              d="M19 2.06472L23 6.06472C23 6.06472 25.4269 4.58801 25.5 3.06472C25.5504 2.01441 25.3183 1.22513 24.5 0.564716C23.7252 -0.0606102 22.988 -0.0587785 22 0.0647161C20.6028 0.239364 19 2.06472 19 2.06472Z"
              fill="white"
            />
          </svg>
        </button>
      </div>
    </div>
  );
};

export default Pattern;
